Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ8110CA90100.atdf
    <module name="HSM" id="03785" name2="sec_hsm_v1" version="1a0" caption="Hardware Security Module">
      <register-group name="HSM" caption="Hardware Security Module">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="CONTROL REGISTER A">
          <bitfield name="ENABLE" caption="Clock Enable bit" mask="0x2"/>
          <bitfield name="PRIV" caption="Privileged Access Only bit" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby bit" mask="0x40"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CONTROL REGISTER B">
          <bitfield name="CANCEL" caption="Cancel Command" mask="0x1"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="INTERRUPT ENABLE CLEAR REGISTER">
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0xC" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="INTERRUPT ENABLE SET">
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="INTERRUPT FLAG">
          <bitfield name="ERROR" caption="Error Interrupt Flag" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt Flag" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="STATUS">
          <bitfield name="BUSY" caption="HSM CPU BUSY" mask="0x1"/>
          <bitfield name="LKUP" caption="HSM CPU LOCKUP" mask="0x2"/>
          <bitfield name="PS" caption="PROCESSING STATE" mask="0x70"/>
          <bitfield name="LCS" caption="LIFECYCLE STATE" mask="0x700"/>
          <bitfield name="SBS" caption="SECURE BOOT STATE" mask="0x7000"/>
          <bitfield name="ECODE" caption="ERROR CODE" mask="0xF0000"/>
        </register>
        <register name="MBFIFO" offset="0x100" rw="RW" ocd-rw="" size="4" count="16" initval="0x00000000" caption="MAILBOX FIFO">
          <bitfield name="MBFIFO" caption="MAILBOX FIFO" mask="0xFFFFFFFF"/>
        </register>
        <register name="MBTXSTATUS" offset="0x140" rw="RW" size="4" initval="0x00100000" caption="MAILBOX TRANSMIT STATUS">
          <bitfield name="TXREMAINING" caption="TRANSMIT BYTES REMAINING" mask="0xFFFF"/>
          <bitfield name="TXTYPE" caption="TRANSMIT MESSAGE HEADER TYPE" mask="0xF0000"/>
          <bitfield name="TXINT" caption="TRANSMIT FIFO INTERRUPT FLAG" mask="0x100000"/>
          <bitfield name="TXFULL" caption="TRANSMIT FIFO FULL" mask="0x200000"/>
          <bitfield name="TXERR" caption="TRANSMIT ERROR" mask="0x800000"/>
        </register>
        <register name="MBRXSTATUS" offset="0x144" rw="RW" size="4" initval="0x00200000" caption="MAILBOX RECEIVE STATUS">
          <bitfield name="RXREMAINING" caption="RECEIVE BYTES REMAINING" mask="0xFFFF"/>
          <bitfield name="RXTYPE" caption="RECEIVE MESSAGE HEADER TYPE" mask="0xF0000"/>
          <bitfield name="RXINT" caption="RECEIVE FIFO INTERRUPT FLAG" mask="0x100000"/>
          <bitfield name="RXEMPTY" caption="RECEIVE FIFO FULL" mask="0x200000"/>
          <bitfield name="RXHEAD" caption="Receive Header Next Word bit" mask="0x400000"/>
          <bitfield name="RXERR" caption="RECEIVE ERROR" mask="0x800000"/>
        </register>
        <register name="MBTXPROT" offset="0x148" rw="RW" size="4" initval="0x00000000" caption="MAILBOX TX PROTECTION">
          <bitfield name="UNPROT" caption="MAILBOX UNPROTECTED" mask="0x200000"/>
          <bitfield name="PRIV" caption="MAILBOX MESSAGE PRIVILEDGED ACCESS" mask="0x400000"/>
          <bitfield name="NSEC" caption="MAILBOX MESSAGE NON-SECURE ACCESS" mask="0x800000"/>
          <bitfield name="USER" caption="USER SIDEBAND" mask="0xFF000000"/>
        </register>
        <register name="MBRXPROT" offset="0x14C" rw="RW" size="4" initval="0x00000000" caption="MAILBOX RX PROTECTION">
          <bitfield name="UNPROT" caption="MAILBOX UNPROTECTED" mask="0x200000"/>
          <bitfield name="PRIV" caption="MAILBOX MESSAGE PRIVILEDGED ACCESS" mask="0x400000"/>
          <bitfield name="NSEC" caption="MAILBOX MESSAGE NON-SECURE ACCESS" mask="0x800000"/>
          <bitfield name="USER" caption="USER SIDEBAND" mask="0xFF000000"/>
        </register>
        <register name="MBTXHEAD" offset="0x150" rw="RW" ocd-rw="" size="4" initval="0x00000000" caption="MAILBOX TRANSMIT HEADER">
          <bitfield name="TXHEAD" caption="MAILBOX TRANSMIT HEADER REGISTER" mask="0xFFFFFFFF"/>
        </register>
        <register name="MBRXHEAD" offset="0x154" rw="RW" ocd-rw="" size="4" initval="0x00000000" caption="MAILBOX RECEIVE HEADER">
          <bitfield name="RXHEAD" caption="MAILBOX RECEIVE HEADER REGISTER" mask="0xFFFFFFFF"/>
        </register>
        <register name="MBCONFIG" offset="0x158" rw="RW" size="4" initval="0x00000000" caption="MAILBOX CONFIGURATION">
          <bitfield name="TXINT" caption="MAILBOX TRANSMIT INTERRUPT ENABLE" mask="0x1"/>
          <bitfield name="RXINT" caption="MAILBOX RECEIVE INTERRUPT ENABLE" mask="0x2"/>
        </register>
      </register-group>
    </module>
    <module name="ITM" id="SYSTEM_IP" version="1.0.0" caption="Instrumentation Trace Macrocell">
      <register-group name="ITM" caption="Instrumentation Trace Macrocell">
        <register name="PORT" offset="0x0" rw="W" size="4" access-size="4" count="32" caption="ITM Stimulus Port Registers">
          <mode name="BYTE"/>
          <mode name="HWORD"/>
          <mode name="WORD"/>
          <bitfield modes="BYTE" name="PORT" caption="" mask="0xFF"/>
          <bitfield modes="HWORD" name="PORT" caption="" mask="0xFFFF"/>
          <bitfield modes="WORD" name="PORT" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="TER" offset="0xE00" rw="RW" size="4" access-size="4" caption="ITM Trace Enable Register">
        </register>
