Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ8110CA90100.atdf
        <register name="CA1R" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00010070" caption="Capabilities 1">
          <bitfield name="SDR50SUP" caption="SDR50 Support" mask="0x1" values="CA1R__SDR50SUP"/>
          <bitfield name="SDR104SUP" caption="SDR104 Support" mask="0x2" values="CA1R__SDR104SUP"/>
          <bitfield name="DDR50SUP" caption="DDR50 Support" mask="0x4" values="CA1R__DDR50SUP"/>
          <bitfield name="DRVASUP" caption="Driver Type A Support" mask="0x10" values="CA1R__DRVASUP"/>
          <bitfield name="DRVCSUP" caption="Driver Type C Support" mask="0x20" values="CA1R__DRVCSUP"/>
          <bitfield name="DRVDSUP" caption="Driver Type D Support" mask="0x40" values="CA1R__DRVDSUP"/>
          <bitfield name="TCNTRT" caption="Timer Count for Re-Tuning" mask="0xF00" values="CA1R__TCNTRT"/>
          <bitfield name="TSDR50" caption="Use Tuning for SDR50" mask="0x2000" values="CA1R__TSDR50"/>
          <bitfield name="CLKMULT" caption="Clock Multiplier" mask="0xFF0000" values="CA1R__CLKMULT"/>
        </register>
        <register name="MCCAR" offset="0x48" rw="R" size="4" access-size="4" initval="0x00000000" caption="Maximum Current Capabilities">
          <bitfield name="MAXCUR33V" caption="Maximum Current for 3.3V" mask="0xFF" values="MCCAR__MAXCUR33V"/>
          <bitfield name="MAXCUR30V" caption="Maximum Current for 3.0V" mask="0xFF00" values="MCCAR__MAXCUR30V"/>
          <bitfield name="MAXCUR18V" caption="Maximum Current for 1.8V" mask="0xFF0000" values="MCCAR__MAXCUR18V"/>
        </register>
        <register name="FERACES" offset="0x50" rw="W" size="2" access-size="2" initval="0x0000" caption="Force Event for Auto CMD Error Status">
          <bitfield name="ACMD12NE" caption="Force Event for Auto CMD12 Not Executed" mask="0x1" values="FERACES__ACMD12NE"/>
          <bitfield name="ACMDTEO" caption="Force Event for Auto CMD Timeout Error" mask="0x2" values="FERACES__ACMDTEO"/>
          <bitfield name="ACMDCRC" caption="Force Event for Auto CMD CRC Error" mask="0x4" values="FERACES__ACMDCRC"/>
          <bitfield name="ACMDEND" caption="Force Event for Auto CMD End Bit Error" mask="0x8" values="FERACES__ACMDEND"/>
          <bitfield name="ACMDIDX" caption="Force Event for Auto CMD Index Error" mask="0x10" values="FERACES__ACMDIDX"/>
          <bitfield name="CMDNI" caption="Force Event for Command Not Issued By Auto CMD12 Error" mask="0x80" values="FERACES__CMDNI"/>
        </register>
        <register name="FEREIS" offset="0x52" rw="W" size="2" access-size="2" initval="0x0000" caption="Force Event for Error Interrupt Status">
          <bitfield name="CMDTEO" caption="Force Event for Command Timeout Error" mask="0x1" values="FEREIS__CMDTEO"/>
          <bitfield name="CMDCRC" caption="Force Event for Command CRC Error" mask="0x2" values="FEREIS__CMDCRC"/>
          <bitfield name="CMDEND" caption="Force Event for Command End Bit Error" mask="0x4" values="FEREIS__CMDEND"/>
          <bitfield name="CMDIDX" caption="Force Event for Command Index Error" mask="0x8" values="FEREIS__CMDIDX"/>
          <bitfield name="DATTEO" caption="Force Event for Data Timeout Error" mask="0x10" values="FEREIS__DATTEO"/>
          <bitfield name="DATCRC" caption="Force Event for Data CRC Error" mask="0x20" values="FEREIS__DATCRC"/>
          <bitfield name="DATEND" caption="Force Event for Data End Bit Error" mask="0x40" values="FEREIS__DATEND"/>
          <bitfield name="CURLIM" caption="Force Event for Current Limit Error" mask="0x80" values="FEREIS__CURLIM"/>
          <bitfield name="ACMD" caption="Force Event for Auto CMD Error" mask="0x100" values="FEREIS__ACMD"/>
          <bitfield name="ADMA" caption="Force Event for ADMA Error" mask="0x200" values="FEREIS__ADMA"/>
          <bitfield name="BOOTAE" caption="Force Event for Boot Acknowledge Error" mask="0x1000" values="FEREIS__BOOTAE"/>
        </register>
        <register name="AESR" offset="0x54" rw="R" size="1" access-size="1" initval="0x00" caption="ADMA Error Status">
          <bitfield name="ERRST" caption="ADMA Error State" mask="0x3" values="AESR__ERRST"/>
          <bitfield name="LMIS" caption="ADMA Length Mismatch Error" mask="0x4" values="AESR__LMIS"/>
        </register>
        <register name="ASAR" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="ADMA System Address n">
          <bitfield name="ADMASA" caption="ADMA System Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="PVR" offset="0x60" rw="RW" size="2" access-size="2" count="3" initval="0x0000" caption="Preset Value n">
          <bitfield name="SDCLKFSEL" caption="SDCLK Frequency Select Value for Initialization" mask="0x3FF"/>
          <bitfield name="CLKGSEL" caption="Clock Generator Select Value for Initialization" mask="0x400" values="PVR__CLKGSEL"/>
          <bitfield name="DRVSEL" caption="Driver Strength Select Value for Initialization" mask="0xC000" values="PVR__DRVSEL"/>
        </register>
        <register name="SISR" offset="0xFC" rw="R" size="2" access-size="2" initval="0x0000" caption="Slot Interrupt Status">
          <bitfield name="INTSSL" caption="Interrupt Signal for Each Slot" mask="0x3"/>
        </register>
        <register name="HCVR" offset="0xFE" rw="R" size="2" access-size="2" initval="0x2002" caption="Host Controller Version">
          <bitfield name="SVER" caption="Spec Version" mask="0xFF"/>
          <bitfield name="VVER" caption="Vendor Version" mask="0xFF00"/>
        </register>
        <register name="MC1R" offset="0x204" rw="RW" size="1" access-size="1" initval="0x00" caption="e.MMC Control 1">
          <bitfield name="CMDTYP" caption="e.MMC Command Type" mask="0x3" values="MC1R__CMDTYP"/>
          <bitfield name="DDR" caption="e.MMC HSDDR Mode" mask="0x8"/>
          <bitfield name="OPD" caption="e.MMC Open Drain Mode" mask="0x10"/>
          <bitfield name="BOOTA" caption="e.MMC Boot Acknowledge Enable" mask="0x20"/>
          <bitfield name="RSTN" caption="e.MMC Reset Signal" mask="0x40"/>
          <bitfield name="FCD" caption="e.MMC Force Card Detect" mask="0x80"/>
        </register>
