Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ8110CA90100.atdf
      <value-group name="USART_CTRLB__ENC">
        <value name="DISABLE" caption="Data is not encoded" value="0x0"/>
        <value name="IRDA" caption="Data is IrDA encoded" value="0x1"/>
      </value-group>
      <value-group name="USART_CTRLB__PMODE">
        <value name="EVEN" caption="Even parity" value="0x0"/>
        <value name="ODD" caption="Odd parity" value="0x1"/>
      </value-group>
      <value-group name="USART_CTRLB__FIFOCLR">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="TXFIFO" caption="Clear TX FIFO" value="0x1"/>
        <value name="RXFIFO" caption="Clear RX FIFO" value="0x2"/>
        <value name="BOTH" caption="Clear both TX and RF FIFOs" value="0x3"/>
      </value-group>
      <value-group name="USART_CTRLB__LINCMD">
        <value name="NONE" caption="Normal USART transmission" value="0x0"/>
        <value name="SOFTWARE_CONTROL_TRANSMIT_CMD" caption="Break field is transmitted when DATA is written" value="0x1"/>
        <value name="AUTO_TRANSMIT_CMD" caption="Break, synch and identifier are automaticcaly transmitted when DATA is written with the identifier" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLC__RXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated when DATA is present in the FIFO" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when FIFO is half-full" value="0x1"/>
        <value name="FULL" caption="Interrupt and DMA triggers are generated when FIFO is full" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLC__TXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when half FIFO space is free" value="0x1"/>
        <value name="EMPTY" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLC__RXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated when DATA is present in the FIFO" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when FIFO is half-full" value="0x1"/>
        <value name="FULL" caption="Interrupt and DMA triggers are generated when FIFO is full" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLC__TXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when half FIFO space is free" value="0x1"/>
        <value name="EMPTY" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLC__FSLEN">
        <value name="STROBE" caption="One SCK pulse" value="0x0"/>
        <value name="LEVEL" caption="One frame duration" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLC__FSPOL">
        <value name="HIGH" caption="VCC-level valid polarity" value="0x0"/>
        <value name="LOW" caption="GND-level valid polarity" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLC__FMODE">
        <value name="MASTER" caption="Frame Master" value="0x0"/>
        <value name="SLAVE" caption="Frame Slave" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLC__RXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated when DATA is present in the FIFO" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when FIFO is half-full" value="0x1"/>
        <value name="FULL" caption="Interrupt and DMA triggers are generated when FIFO is full" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLC__TXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when half FIFO space is free" value="0x1"/>
        <value name="EMPTY" caption="Interrupt and DMA triggers are generated as long as the FIFO is empty" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLC__BRKLEN">
        <value name="13BITS" caption="Break field transmission is 13 bit times" value="0x0"/>
        <value name="17BITS" caption="Break field transmission is 17 bit times" value="0x1"/>
        <value name="21BITS" caption="Break field transmission is 21 bit times" value="0x2"/>
        <value name="26BITS" caption="Break field transmission is 26 bit times" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLC__HDRDLY">
        <value name="1BIT" caption="Delay between break and sync transmission is 1-bit time" value="0x0"/>
        <value name="4BITS" caption="Delay between break and sync transmission is 4-bit time" value="0x1"/>
        <value name="8BITS" caption="Delay between break and sync transmission is 8-bit time" value="0x2"/>
        <value name="14BITS" caption="Delay between break and sync transmission is 14-bit time" value="0x3"/>
      </value-group>
      <value-group name="USART_CTRLC__RXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated when DATA is present in the FIFO" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when FIFO is half-full" value="0x1"/>
        <value name="FULL" caption="Interrupt and DMA triggers are generated when FIFO is full" value="0x2"/>
      </value-group>
      <value-group name="USART_CTRLC__TXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when half FIFO space is free" value="0x1"/>
        <value name="EMPTY" caption="Interrupt and DMA triggers are generated when the FIFO is empty" value="0x2"/>
      </value-group>
      <value-group name="USART_LENGTH__LENEN">
        <value name="DISABLE" caption="Length counter is disabled" value="0x0"/>
        <value name="TX" caption="Length counter is enabled for transmit" value="0x1"/>
        <value name="RX" caption="Length counter is enabled for receive" value="0x2"/>
      </value-group>
    </module>
    <module name="SPI_IXS" id="03574" name2="spi_ixs_apb_v1" version="1a0" caption="Audio SPI with 8 channels compatibilty">
      <register-group name="SPI_IXS" caption="Audio SPI with 8 channels compatibilty">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="SPI Control Enable Register">
          <bitfield name="SWRST" caption="SPI Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="SPI Enable (ON) bit" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="RUN STANDBY Mode Enable bit" mask="0x40"/>
        </register>
        <register name="SELCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="SPI Control Options Select Register">
          <bitfield name="CLKINDLY" caption="Serial Clock Input Delay for SDI sampling" mask="0x3" values="SELCTRL__CLKINDLY"/>
          <bitfield name="SRXISEL" caption="SPI Receive Service Request Interrupt Select" mask="0x30" values="SELCTRL__SRXISEL"/>
          <bitfield name="IGNROV" caption="Ignore Receive Overflow (for Audio Data Transmissions)" mask="0x40"/>
          <bitfield name="CPHA" caption="SPI Clock Edge Select bit" mask="0x400"/>
          <bitfield name="CPOL" caption="Clock Polarity Select bit" mask="0x800"/>
          <bitfield name="STXISEL" caption="SPI Transmit Service Request Interrupt Select" mask="0x3000" values="SELCTRL__STXISEL"/>
          <bitfield name="IGNTUR" caption="Ignore Transmit Underrun (for Audio Data Transmissions)" mask="0x4000"/>
          <bitfield name="DATFMTLR" caption="Packed data format -- left or right justified" mask="0x10000"/>
          <bitfield name="TURSAMP" caption="Transmit Under-run last sample sent" mask="0x800000"/>
          <bitfield name="DATFILL" caption="DATFILL undefined bits 1 or 0" mask="0x1000000"/>
          <bitfield name="MODEEN" caption="MACRO MODE ENABLED" mask="0xC0000000" values="SELCTRL__MODEEN"/>
        </register>
        <register name="SPICTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="SPI Control Register">
          <bitfield name="MODE" caption="Serial Word Length bits for AUDEN=0, not used when AUDEN=1" mask="0x3" values="SPICTRL__MODE"/>
          <bitfield name="DISSDI" caption="Disable SDI bit" mask="0x8"/>
          <bitfield name="DISSDO" caption="Disable SDO bit" mask="0x10"/>
          <bitfield name="MSTEN" caption="Master Mode Enable bit" mask="0x20"/>
          <bitfield name="MSSEN" caption="Master/Slave Mode Select Enable bit" mask="0x40"/>
          <bitfield name="SPISGNEXT" caption="Sign Extend Read Data from the RX FIFO" mask="0x200"/>
          <bitfield name="SMP" caption="SPI Data Input Sample Phase bit" mask="0x400"/>
        </register>
        <register name="FRAMECTRL" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="SPI Control Frame Register">
          <bitfield name="FRMSYPW" caption="Frame sync pulse width in serial words" mask="0xF" values="FRAMECTRL__FRMSYPW"/>
          <bitfield name="FRMCOINC" caption="Frame Sync Pulse Edge Select bit" mask="0x100"/>
          <bitfield name="FRMPOL" caption="Frame Sync / Slave Select Polarity bit" mask="0x2000"/>
          <bitfield name="FRMSLV" caption="Frame Sync Pulse Direction Control bit" mask="0x4000"/>
          <bitfield name="FRMCNT" caption="Frame sync pulse counter" mask="0x1F0000" values="FRAMECTRL__FRMCNT"/>
          <bitfield name="TDMSSZ" caption="TDM Number of Bits in a Slot Size" mask="0x7000000" values="FRAMECTRL__TDMSSZ"/>
          <bitfield name="TDMWSZ" caption="TDM Number of Bits in a Word Size" mask="0xE0000000" values="FRAMECTRL__TDMWSZ"/>
        </register>
        <register name="AUDCTRL" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="SPI Control Audio Register">
          <bitfield name="AUDMOD" caption="Audio Protocol Mode" mask="0x3" values="AUDCTRL__AUDMOD"/>
          <bitfield name="AUDMONO" caption="Transmit audio data format" mask="0x8"/>
          <bitfield name="AUDFMT" caption="Audio Protocol Format" mask="0x70" values="AUDCTRL__AUDFMT"/>
          <bitfield name="AUDWDMODE" caption="Serial Word Length bits (Ignored when AUDEN=0)" mask="0x300"/>
        </register>
        <register name="TPDCTRL" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="SPI Control Tpd Register">
          <bitfield name="PKFMT" caption="Master Slave TPD mode." mask="0x7" values="TPDCTRL__PKFMT"/>
          <bitfield name="SLVNUM" caption="Number of the Slave designated: to be used with the PKFMT to determine the slave." mask="0x700" values="TPDCTRL__SLVNUM"/>
        </register>
        <register name="INTENSET" offset="0x18" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="SPI Interrupt Enable Set Register">
          <bitfield name="SPIRXBFEN" caption="Enablie Interrupt Events via SPIRXBF" mask="0x1"/>
          <bitfield name="SPITXBEEN" caption="Enablie Interrupt Events via SPITXBE" mask="0x10"/>
          <bitfield name="FRMERREN" caption="Enable Interrupt Events via FRMERR" mask="0x8000"/>
          <bitfield name="SPITUREN" caption="Enable Interrupt Events via SPITUR" mask="0x8000000"/>
          <bitfield name="SPIROVEN" caption="Enable Interrupt Events via SPIROV" mask="0x40000000"/>
        </register>
        <register name="INTENCLR" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="SPI Interrupt Enable Clear Register">
          <bitfield name="SPIRXBFEN" caption="Enablie Interrupt Events via SPIRXBF" mask="0x1"/>
          <bitfield name="SPITXBEEN" caption="Enablie Interrupt Events via SPITXBE" mask="0x10"/>
          <bitfield name="FRMERREN" caption="Enable Interrupt Events via FRMERR" mask="0x8000"/>
          <bitfield name="SPITUREN" caption="Enable Interrupt Events via SPITUR" mask="0x8000000"/>
          <bitfield name="SPIROVEN" caption="Enable Interrupt Events via SPIROV" mask="0x40000000"/>
        </register>
